000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыЗаказовПокупателей/КлючевыеАтрибутыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеАтрибутыЗаказовПокупателей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВнутреннееИзменение</name>
    <comment>Изменение было проведено в среде 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаказаНаСайте</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияСтатуса</name>
    <comment>Внешнее управление</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПередачи</name>
    <comment>Внешнее управление</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРезервированияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>КоррекцияНачисленийПоПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказаОсновной</name>
    <comment>MainOrder, специфика Magento</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>СтатусИМ</name>
    <comment>Magento</comment>
    <type>
      <types>EnumRef.СтатусыИнтернетМагазина</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусОплаты</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиОператор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиОплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставкиЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплатыЗаказПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗаказовПокупателей/СтатусыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателей</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДоступности</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостоянияЗаказовПокупателей/СостоянияЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовПокупателей</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяРезервирование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ГотовКРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОбрабатываетсяМенеджером</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗапросу</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСолгласовано</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПродаже</name>
  </enumValues>
  <enumValues>
    <name>ЧастичнаяСборкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ЗаказВДороге</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ГотовКДоставке</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплата</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлючевыеАтрибутыЗаказовПокупателей/RecordSetModule.bsl
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ, Замещение)

	Если ДополнительныеСвойства.Свойство("ПроверкаРезервовПолная")
	И	 ДополнительныеСвойства.ПроверкаРезервовПолная.Проверить = Истина
	Тогда	//	LNK 29.05.2023 06:04:36

		ПроверитьЗаполнениеСостояния();

	КонецЕсли;

//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.ДатаИзменения = ТекущаяДата();

	КонецЦикла;

КонецПроцедуры

//	LNK 24.05.2023 06:33:52
Процедура ПриЗаписи(Отказ, Замещение)

	Если ДополнительныеСвойства.Свойство("ПроверкаРезервовПолная")
	И	 ДополнительныеСвойства.ПроверкаРезервовПолная.Проверить = Истина
	Тогда

	//	Выполняем, если назначено, не обращая внимания на флаг загрузки.
		ПроверитьДвиженияЗаказыПокупателейДляПодчинённых(ПолучитьМинимальныйПериод());

	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

#КонецОбласти

//	LNK 24.05.2023 06:32:29
Процедура ПроверитьДвиженияЗаказыПокупателейДляПодчинённых(Период, ВыполнитьПринудительно = Ложь)
		
	УчетнаяПолитика = ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику(Период);

	Если ПроверкаНеобходима(УчетнаяПолитика)
	И	 (УчетнаяПолитика.РазрешитьПрямуюИнтеграциюMagento ИЛИ ВыполнитьПринудительно = Истина)
	Тогда

		ЗаказыПокупателейСервер.ПроверитьДвиженияДляПодчинённыхДокументов(ЭтотОбъект.Отбор.ЗаказПокупателя.Значение);

	КонецЕсли;

КонецПроцедуры

Функция ПолучитьМинимальныйПериод()	//	LNK 24.05.2023 06:48:04

	Период = '00010101';

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если Период = '00010101' ИЛИ ЗаписьНабора.Период < Период Тогда

			Период = ЗаписьНабора.Период;

		КонецЕсли;

	КонецЦикла;

	Возврат Период;

КонецФункции

Функция ПроверкаНеобходима(УчетнаяПолитика)

	Проверить = Ложь;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если ЗаписьНабора.Статус = Перечисления.СтатусыЗаказовПокупателей.Закрыт ИЛИ ЗаписьНабора.Статус = Перечисления.СтатусыЗаказовПокупателей.Отменён Тогда

		//	в этом случае заказ покупателя не делает движений!
			Проверить = Истина;
			Прервать;

		КонецЕсли;

	КонецЦикла;

	Возврат Проверить;

КонецФункции

//	LNK 29.05.2023 06:05:51
Процедура ПроверитьЗаполнениеСостояния()

	НужноПолучитьПоследнее = Ложь;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.Состояние) Тогда

			НужноПолучитьПоследнее = Истина;
			Прервать;

		КонецЕсли;

	КонецЦикла;

	Если НужноПолучитьПоследнее Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Период КАК Период,
		|	ТаблицаРегистра.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей КАК ТаблицаРегистра
		|ГДЕ
		|	 ТаблицаРегистра.ЗаказПокупателя = &ЗаказПокупателя
		|	и НЕ ТаблицаРегистра.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПокупателей.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"
		);
		Запрос.УстановитьПараметр("ЗаказПокупателя", Отбор.ЗаказПокупателя.Значение);

		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

				Если НЕ ЗначениеЗаполнено(ЗаписьНабора.Состояние) Тогда

					ЗаписьНабора.Состояние = Выборка.Состояние;

				КонецЕсли;

			КонецЦикла;
		
		КонецЕсли;
		

	КонецЕсли;

КонецПроцедуры
